lkolbly/cmsis-svd/data/TexasInstruments/LM4F111C4QR.svd
        <register>
          <name>PEND0</name>
          <description>Interrupt 0-31 Set Pending</description>
          <addressOffset>0x00000200</addressOffset>
          <fields>
            <field>
              <name>NVIC_PEND0_INT</name>
              <description>Interrupt Set Pending</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT0</name>
                  <description>Interrupt 0 pend</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT1</name>
                  <description>Interrupt 1 pend</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT2</name>
                  <description>Interrupt 2 pend</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT3</name>
                  <description>Interrupt 3 pend</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT4</name>
                  <description>Interrupt 4 pend</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT5</name>
                  <description>Interrupt 5 pend</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT6</name>
                  <description>Interrupt 6 pend</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT7</name>
                  <description>Interrupt 7 pend</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT8</name>
                  <description>Interrupt 8 pend</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT9</name>
                  <description>Interrupt 9 pend</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT10</name>
                  <description>Interrupt 10 pend</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT11</name>
                  <description>Interrupt 11 pend</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT12</name>
                  <description>Interrupt 12 pend</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT13</name>
                  <description>Interrupt 13 pend</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT14</name>
                  <description>Interrupt 14 pend</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT15</name>
                  <description>Interrupt 15 pend</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT16</name>
                  <description>Interrupt 16 pend</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT17</name>
                  <description>Interrupt 17 pend</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT18</name>
                  <description>Interrupt 18 pend</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT19</name>
                  <description>Interrupt 19 pend</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT20</name>
                  <description>Interrupt 20 pend</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT21</name>
                  <description>Interrupt 21 pend</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT22</name>
                  <description>Interrupt 22 pend</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT23</name>
                  <description>Interrupt 23 pend</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT24</name>
                  <description>Interrupt 24 pend</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT25</name>
                  <description>Interrupt 25 pend</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT26</name>
                  <description>Interrupt 26 pend</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT27</name>
                  <description>Interrupt 27 pend</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT28</name>
                  <description>Interrupt 28 pend</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT29</name>
                  <description>Interrupt 29 pend</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT30</name>
                  <description>Interrupt 30 pend</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT31</name>
                  <description>Interrupt 31 pend</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PEND1</name>
          <description>Interrupt 32-54 Set Pending</description>
          <addressOffset>0x00000204</addressOffset>
          <fields>
            <field>
              <name>NVIC_PEND1_INT</name>
              <description>Interrupt Set Pending</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEND2</name>
          <description>Interrupt 64-95 Set Pending</description>
          <addressOffset>0x00000208</addressOffset>
          <fields>
            <field>
              <name>NVIC_PEND2_INT</name>
              <description>Interrupt Set Pending</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEND3</name>
          <description>Interrupt 96-127 Set Pending</description>
          <addressOffset>0x0000020C</addressOffset>
          <fields>
            <field>
              <name>NVIC_PEND3_INT</name>
              <description>Interrupt Set Pending</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEND4</name>
          <description>Interrupt 128-131 Set Pending</description>
          <addressOffset>0x00000210</addressOffset>
          <fields>
            <field>
              <name>NVIC_PEND4_INT</name>
              <description>Interrupt Set Pending</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UNPEND0</name>
          <description>Interrupt 0-31 Clear Pending</description>
          <addressOffset>0x00000280</addressOffset>
          <fields>
            <field>
              <name>NVIC_UNPEND0_INT</name>
              <description>Interrupt Clear Pending</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT0</name>
                  <description>Interrupt 0 unpend</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT1</name>
                  <description>Interrupt 1 unpend</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT2</name>
                  <description>Interrupt 2 unpend</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT3</name>
                  <description>Interrupt 3 unpend</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT4</name>
                  <description>Interrupt 4 unpend</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT5</name>
                  <description>Interrupt 5 unpend</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT6</name>
                  <description>Interrupt 6 unpend</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT7</name>
                  <description>Interrupt 7 unpend</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT8</name>
                  <description>Interrupt 8 unpend</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT9</name>
                  <description>Interrupt 9 unpend</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT10</name>
                  <description>Interrupt 10 unpend</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT11</name>
                  <description>Interrupt 11 unpend</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT12</name>
                  <description>Interrupt 12 unpend</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT13</name>
                  <description>Interrupt 13 unpend</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT14</name>
                  <description>Interrupt 14 unpend</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT15</name>
                  <description>Interrupt 15 unpend</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT16</name>
                  <description>Interrupt 16 unpend</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT17</name>
                  <description>Interrupt 17 unpend</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT18</name>
                  <description>Interrupt 18 unpend</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT19</name>
                  <description>Interrupt 19 unpend</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT20</name>
                  <description>Interrupt 20 unpend</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT21</name>
                  <description>Interrupt 21 unpend</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT22</name>
                  <description>Interrupt 22 unpend</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT23</name>
                  <description>Interrupt 23 unpend</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT24</name>
                  <description>Interrupt 24 unpend</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT25</name>
                  <description>Interrupt 25 unpend</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT26</name>
                  <description>Interrupt 26 unpend</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT27</name>
                  <description>Interrupt 27 unpend</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT28</name>
                  <description>Interrupt 28 unpend</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT29</name>
                  <description>Interrupt 29 unpend</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT30</name>
                  <description>Interrupt 30 unpend</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT31</name>
                  <description>Interrupt 31 unpend</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UNPEND1</name>
          <description>Interrupt 32-54 Clear Pending</description>
          <addressOffset>0x00000284</addressOffset>
          <fields>
            <field>
              <name>NVIC_UNPEND1_INT</name>
              <description>Interrupt Clear Pending</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT32</name>
                  <description>Interrupt 32 unpend</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT33</name>
                  <description>Interrupt 33 unpend</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT34</name>
                  <description>Interrupt 34 unpend</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT35</name>
                  <description>Interrupt 35 unpend</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT36</name>
                  <description>Interrupt 36 unpend</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT37</name>
                  <description>Interrupt 37 unpend</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT38</name>
                  <description>Interrupt 38 unpend</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT39</name>
                  <description>Interrupt 39 unpend</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT40</name>
                  <description>Interrupt 40 unpend</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT41</name>
                  <description>Interrupt 41 unpend</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT42</name>
                  <description>Interrupt 42 unpend</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT43</name>
                  <description>Interrupt 43 unpend</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT44</name>
                  <description>Interrupt 44 unpend</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT45</name>
                  <description>Interrupt 45 unpend</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT46</name>
                  <description>Interrupt 46 unpend</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT47</name>
                  <description>Interrupt 47 unpend</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT48</name>
                  <description>Interrupt 48 unpend</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT49</name>
                  <description>Interrupt 49 unpend</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT50</name>
                  <description>Interrupt 50 unpend</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT51</name>
                  <description>Interrupt 51 unpend</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT52</name>
                  <description>Interrupt 52 unpend</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT53</name>
                  <description>Interrupt 53 unpend</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT54</name>
                  <description>Interrupt 54 unpend</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND1_INT55</name>
                  <description>Interrupt 55 unpend</description>
                  <value>0x800000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UNPEND2</name>
          <description>Interrupt 64-95 Clear Pending</description>
          <addressOffset>0x00000288</addressOffset>
          <fields>
            <field>
              <name>NVIC_UNPEND2_INT</name>
              <description>Interrupt Clear Pending</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UNPEND3</name>
          <description>Interrupt 96-127 Clear Pending</description>
          <addressOffset>0x0000028C</addressOffset>
          <fields>
            <field>
              <name>NVIC_UNPEND3_INT</name>
              <description>Interrupt Clear Pending</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UNPEND4</name>
          <description>Interrupt 128-131 Clear Pending</description>
          <addressOffset>0x00000290</addressOffset>
          <fields>
            <field>
              <name>NVIC_UNPEND4_INT</name>
              <description>Interrupt Clear Pending</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
